# Задача «Площадь прямоугольного треугольника»
# Числа b и h можно считывать так:
b = int(input("введите первого катета "))
h = int(input("введите второго катета "))
s = b*h*0.5
print("площадь прямоугольного треугольника равна", s)
