"""
Задача «Hello, Harry!»
Условие
Напишите программу, которая приветствует пользователя,
выводя слово Hello, введенное имя и знаки препинания по образцу:
"""

name = input()
print("Hello, " + name + "!")
